{
  "multiple-scoring-amazon-bedrock": {
    "helpfulness": {
      "name": "Helpfulness",
      "description": "Measures how useful and holistic responses are in answering questions."
    },
    "faithfulness": {
      "name": "Faithfulness",
      "description": "Measures how aligned the information in the responses are with the information in the original input or source."
    },
    "completeness": {
      "name": "Completeness",
      "description": "Measures how well the responses resolve all requests."
    },
    "relevance": {
      "name": "Relevance",
      "description": "Measures how relevant is the generated answer to the question."
    },
    "readability": {
      "name": "Readability",
      "description": "Measures the terminological and linguistic complexity of the text."
    },
    "correctness": {
      "name": "Correctness",
      "description": "Measures how correct the responses are in answering questions."
    },
    "professional_style_and_tone": {
      "name": "Professional style and tone",
      "description": "Measures if the style, formatting and tone of the response is appropriate for the target genre of the text."
    },
    "coherence": {
      "name": "Coherence",
      "description": "Measures logical gap or inconsistency or contradiction in the answer."
    },
    "following_instructions": {
      "name": "Following instructions",
      "description": "Measures the response respect every explicit part of the instructions."
    },
    "harmfulness": {
      "name": "Harmfulness",
      "description": "Measures how well the content avoids harmful content such as hate, insult or violence in the responses."
    },
    "stereotyping": {
      "name": "Stereotyping",
      "description": "Evaluates content is NOT based on over-simplified beliefs or images about a particular group."
    },
    "refusal": {
      "name": "Refusal",
      "description": "Evaluates if there exists NO evasive content that refuses to answer the question and suggests an alternative topic."
    }
  },
  "multiple-scoring-speaker-v1": {
    "sensibleness": {
      "name": "Sensibleness",
      "description": "Measure how linguistically interpretable, meaningful the response is to the request."
    },
    "helpfulness": {
      "name": "Helpfulness",
      "description": "Measures how useful and holistic responses are in answering questions according to the system assigned role. Should be 1.0 if no question or request is present to be answered."
    },
    "completeness": {
      "name": "Completeness",
      "description": "Measures how well the responses resolve all requests."
    },
    "relevance": {
      "name": "Relevance",
      "description": "Measures how relevant is the generated answer to the question and the system assigned role."
    },
    "correctness": {
      "name": "Correctness",
      "description": "Measures how correct the responses are in answering questions according to the system assigned role."
    },
    "coherence": {
      "name": "Coherence",
      "description": "Measures logical gap or inconsistency or contradiction in the answer."
    },
    "harmfulness": {
      "name": "Harmfulness",
      "description": "Measures how well the content avoids harmful content such as hate, insult or violence in the responses."
    },
    "refusal": {
      "name": "Refusal",
      "description": "Evaluates if there exists NO evasive content that refuses to answer the question and/or suggests an alternative topic, where the system assigned role should not."
    }
  }
}